In [2]:
import pandas as pd
chips_df = pd.read_table("http://bit.ly/chiporders")
chips_df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [6]:
str="name_of_the_column"
print(str.split("_")[-1][:3])

col

In [12]:
def get_proper_name(col):
    return(col.split("_")[-1][:5])

chips_df.columns=list(map(get_proper_name, chips_df.columns))
chips_df.head()

,id,quant,name,descr,price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
print(float("$2.39".strip("$")))
print(float("$2.39".replace("$","")))
print(float("$2.39"[1:]))

2.39
2.39
2.39

In [3]:
for c in chips_df.columns:
    print(c)

order_id
quantity
item_name
choice_description
item_price

In [5]:
type(chips_df["item_name"].head())

pandas.core.series.Series

In [6]:
chips_df["item_name"].head()

0             Chips and Fresh Tomato Salsa
1                                     Izze
2                         Nantucket Nectar
3    Chips and Tomatillo-Green Chili Salsa
4                             Chicken Bowl
Name: item_name, dtype: object

In [7]:
#series and list properties are same, what we can do on list, we can do on series. so no need to convert series into list

In [13]:
print(len(chips_df["item_name"]))

4622

In [18]:
# how to read multiple columns
chips_df[["item_name","item_price"]].head(5) #to print multiple columns in one line, you need to put list within the list or provide 
#column names in a separate list
# columns_read = ["quantity", "item_name"]
# chips_df[columns_read].head()

                               item_name item_price
0           Chips and Fresh Tomato Salsa     $2.39
1                                   Izze     $3.39
2                       Nantucket Nectar     $3.39
3  Chips and Tomatillo-Green Chili Salsa     $2.39
4                           Chicken Bowl    $16.98
5                           Chicken Bowl    $10.98
6                          Side of Chips     $1.69
7                          Steak Burrito    $11.75
8                       Steak Soft Tacos     $9.25
9                          Steak Burrito     $9.25

In [20]:
new_chips_df= chips_df.rename(columns={"item_price":"price"})
new_chips_df.head()
#this will indeed create a new df, original df remains same. to change original df, we need to put inplace=true clause

,order_id,quantity,item_name,choice_description,price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [22]:
def get_col_name_modify(col_name):
    return col_name.split("_")[-1][:5].strip()
list(map(get_col_name_modify, new_chips_df.columns))
#this is how we can modify column names (not in place though) and pass it as list to another df as column names

['id', 'quant', 'name', 'descr', 'price']

In [26]:
home_user=["id","age","gender","occupation","extension"]
movie_user_df=pd.read_table("http://bit.ly/movieusers",sep='|', header=None, names=home_user)
movie_user_df.head()

   id  age gender  occupation extension
0   1   24      M  technician     85711
1   2   53      F       other     94043
2   3   23      M      writer     32067
3   4   24      M  technician     43537
4   5   33      F       other     15213

In [27]:
movie_user_df.head(3)

   id  age gender  occupation extension
0   1   24      M  technician     85711
1   2   53      F       other     94043
2   3   23      M      writer     32067

In [30]:
boolean_mask=movie_user_df["gender"]=='M'
#boolean_mask is a series
boolean_mask.head()

0     True
1    False
2     True
3     True
4    False
Name: gender, dtype: bool

In [35]:
#find top 5 male, student (occupation)
boolean_mask= (movie_user_df["gender"]=='M') & (movie_user_df["occupation"]=="student")
movie_user_df.loc[boolean_mask, :].head()
#just like & operator we have or operator like |

    id  age gender occupation extension
8    9   29      M    student     01002
29  30    7      M    student     55436
32  33   23      M    student     27510
36  37   23      M    student     55105
65  66   23      M    student     80521

In [36]:
# all members who are male and who are either student or technician
boolean_mask= (movie_user_df["gender"]=='M') & ((movie_user_df["occupation"]=="student") | (movie_user_df["occupation"]=="technician"))
movie_user_df.loc[boolean_mask, :].head()

    id  age gender  occupation extension
0    1   24      M  technician     85711
3    4   24      M  technician     43537
8    9   29      M     student     01002
29  30    7      M     student     55436
32  33   23      M     student     27510

In [38]:
movie_user_df.loc[(movie_user_df["occupation"].isin(["student","technician"]))].head()

    id  age gender  occupation extension
0    1   24      M  technician     85711
3    4   24      M  technician     43537
8    9   29      M     student     01002
29  30    7      M     student     55436
31  32   28      F     student     78741

In [41]:
movie_user_df.dtypes

id             int64
age            int64
gender        object
occupation    object
extension     object
dtype: object

In [42]:
#find bill by multiplying quantity * price
chips = pd.read_table("http://bit.ly/chiporders")
chips.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [49]:
chips["item_price"]=chips["item_price"].str[1:].astype(float)
chips["bill"]= chips["quantity"]*chips["item_price"]
chips.head()

,order_id,quantity,item_name,choice_description,item_price,bill
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [56]:
chips_new=pd.read_table("http://bit.ly/chiporders")
chips_new.head()
chips_new["bill"]=chips_new["item_price"].str.replace("$","").astype(float)*chips_new["quantity"]
chips_new.head()

,order_id,quantity,item_name,choice_description,item_price,bill
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,33.96

In [59]:
#print where item_name has chicken in it.
#why did we use str multiple times
#after .str it becomes string
chips_new.loc[(chips_new["item_name"].str.lower().str.contains("chicken")), :].head()

,order_id,quantity,item_name,choice_description,item_price,bill
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,33.96
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98,10.98
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75,8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75,8.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25,11.25

In [61]:
#print where item_name does not have chicken in it.
chicken_orders_df=chips_new.loc[(chips_new["item_name"].str.lower().str.find("chicken")==-1), :]
chicken_orders_df.head(15)

,order_id,quantity,item_name,choice_description,item_price,bill
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
6,3,1,Side of Chips,NaN,$1.69,1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75,11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25,9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25,9.25
10,5,1,Chips and Guacamole,NaN,$4.45,4.45
14,7,1,Chips and Guacamole,NaN,$4.45,4.45
15,8,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
18,9,2,Canned Soda,[Sprite],$2.18,4.36
20,10,1,Chips and Guacamole,NaN,$4.45,4.45
21,11,1,Barbacoa Burrito,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$8.99,8.99
22,11,1,Nantucket Nectar,[Pomegranate Cherry],$3.39,3.39

In [26]:
import pandas as pd
chips_new_self=pd.read_table("http://bit.ly/chiporders")
# print(chips_new_self["item_name"].unique())  #prints distinct value of that column
# print(chips_new_self["item_name"].value_counts()) #prints item_name, count(*) group by item_name
#count of item_name where it has Chips in it , but its perhaps not printing all item_name
boolean_val=(chips_new_self["item_name"].isin(["Chips"]))
new_df=chips_new_self.loc[boolean_val, :]
new_df["item_name"].value_counts()

new_df2 = chips_new_self[chips_new_self.quantity==2]
print(new_df2.head())

new_df3 = chips_new_self.loc[(chips_new_self["quantity"]==2), :]
print(new_df3.head())

     order_id  quantity           item_name  \
4           2         2        Chicken Bowl
18          9         2         Canned Soda
51         23         2         Canned Soda
135        60         2  Chicken Salad Bowl
148        67         2       Steak Burrito

                                    choice_description item_price
4    [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
18                                            [Sprite]     $2.18
51                                      [Mountain Dew]     $2.18
135  [Tomatillo Green Chili Salsa, [Sour Cream, Che...    $22.50
148  [Tomatillo-Red Chili Salsa (Hot), [Rice, Chees...    $17.98
     order_id  quantity           item_name  \
4           2         2        Chicken Bowl
18          9         2         Canned Soda
51         23         2         Canned Soda
135        60         2  Chicken Salad Bowl
148        67         2       Steak Burrito

                                    choice_description item_price
4    [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
18                                            [Sprite]     $2.18
51                                      [Mountain Dew]     $2.18
135  [Tomatillo Green Chili Salsa, [Sour Cream, Che...    $22.50
148  [Tomatillo-Red Chili Salsa (Hot), [Rice, Chees...    $17.98

In [ ]:
#ufo = pd.read_csv("http://bit.ly/uforeports")

In [1]:
#pandas practise on drinks data.
##ufo = pd.read_csv("http://bit.ly/uforeports") - practise on this data
import pandas as pd
ufo = pd.read_csv("http://bit.ly/uforeports")
ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [2]:
#NaN is not a number, basically Null.
#find distinct city in this data
#find count of each cities, city, count(*)
#sort this data by state or time 
#find records count of each shape type
ufo.describe()
chips.loc[(chips["name"].str.lower().str.contains("chicken")), :]

           City Colors Reported Shape Reported  State              Time
count     18215            2882          15597  18241             18241
unique     6475              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [4]:
ufo.shape
#that means, it has 5 column and 18241 rows

(18241, 5)

In [6]:
#find distinct city in this data
ufo.City.unique()

array(['Ithaca', 'Willingboro', 'Holyoke', ..., 'Capitola', 'Grant Park',
       'Ybor'], dtype=object)

In [7]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [8]:
type(ufo.columns)
#Iterabale

pandas.core.indexes.base.Index

In [10]:
ufo.head().shape

(5, 5)

In [17]:
#how to select a column, and output will be a series
ufo["City"]

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [18]:
type(ufo["City"].head())

pandas.core.series.Series

In [20]:
# select the index from a series
ufo["City"].index

RangeIndex(start=0, stop=18241, step=1)

In [21]:
#we can convert series int list
list(ufo["City"].head())

['Ithaca', 'Willingboro', 'Holyoke', 'Abilene', 'New York Worlds Fair']

In [22]:
#read multiple columns
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [24]:
#before that rename column and create a new df
#thr could be multiple ways to rename columns
ufo_new = ufo.rename(columns={"Colors Reported":"colors", "Shape Reported":"shape","State":"state","City":"city","Time":"time"})
ufo_new.head()

                   city colors     shape state             time
0                Ithaca    NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL    CO  2/15/1931 14:00
3               Abilene    NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT    NY  4/18/1933 19:00

In [29]:
#Other method could be like this, define a function, create a list with new names, 
def rename_column_name(col_name):
    return col_name.split(" ")[-1].strip().lower()
proper_column_names = list(map(rename_column_name, ufo.columns))
print(proper_column_names)

['city', 'reported', 'reported', 'state', 'time']

In [3]:
#another method
def rename_column_name(col_name):
    return col_name.split(" ")[0].strip().lower()
proper_column_names = [rename_column_name(col) for col in ufo.columns]
print(proper_column_names)

['city', 'colors', 'shape', 'state', 'time']

In [5]:
#now we can assign name this name back to column
ufo.columns=proper_column_names
ufo.head()

                   city colors     shape state             time
0                Ithaca    NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL    CO  2/15/1931 14:00
3               Abilene    NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT    NY  4/18/1933 19:00

In [6]:
#fetch rows where shape is triangle
ufo.loc[ufo["shape"]=="TRIANGLE",:].head() #fetching all columns & rows where shape is triangle

           city  colors     shape state              time
0        Ithaca     NaN  TRIANGLE    NY    6/1/1930 22:00
52    San Deigo     NaN  TRIANGLE    CA   4/15/1947 23:00
123  Fort Lewis     NaN  TRIANGLE    WA   5/12/1950 14:00
147  Sandy Hook     NaN  TRIANGLE    NJ  10/15/1950 15:00
174  Greenville  ORANGE  TRIANGLE    TX   4/15/1952 16:00

In [11]:
mask=((ufo["shape"]=="TRIANGLE") & (ufo["city"]=="Greenville"))
ufo.loc[mask,:]

             city  colors     shape state             time
174    Greenville  ORANGE  TRIANGLE    TX  4/15/1952 16:00
4182   Greenville     NaN  TRIANGLE    PA   9/1/1979 20:00
5006   Greenville     NaN  TRIANGLE    VA  3/15/1984 21:30
6987   Greenville     NaN  TRIANGLE    SC   3/1/1993 21:30
15464  Greenville     NaN  TRIANGLE    NH  12/8/1999 18:15

In [ ]:
#just like &, we have or | as well

In [ ]:
boolean_mask = \
(movie_users["gender"]=="M") & ( (movie_users["occupation"]=="student") | (movie_users["occupation"]=="technician"))

In [ ]:
#rather than writing so many filter condition, we can use isin

In [15]:
ufo.loc[ufo["shape"].isin(["OVAL","TRAIANGLE"]), :]

                 city colors shape state              time
2             Holyoke    NaN  OVAL    CO   2/15/1931 14:00
13             Keokuk    NaN  OVAL    IA     7/7/1939 2:00
39        San Antonio    NaN  OVAL    NM   8/16/1945 11:30
46     South Portland    NaN  OVAL    ME    7/1/1946 13:30
63          Baltimore    NaN  OVAL    MD   6/30/1947 18:00
...               ...    ...   ...   ...               ...
18196         Brocton  GREEN  OVAL    MA  12/26/2000 18:23
18199   Prospect Park    NaN  OVAL    PA  12/26/2000 23:15
18230     Pismo Beach    NaN  OVAL    CA  12/31/2000 20:00
18231     Pismo Beach    NaN  OVAL    CA  12/31/2000 20:00
18240            Ybor    NaN  OVAL    FL  12/31/2000 23:59

[845 rows x 5 columns]

In [16]:
#how to convert a string column into float if its possible
#chips["item_price"].str.replace("$", "")
chips = pd.read_table("http://bit.ly/chiporders")
chips.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [24]:
chips["price"]=chips["item_price"].str.replace("$","").astype(float)
chips.head()

,order_id,quantity,item_name,choice_description,item_price,price,bill
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98,16.98 16.98

In [18]:
chips["item_price"].str.replace("$", "").astype(float)

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [25]:
#chips["bill"]=chips["quantity"].astype(float) * chips["price"]
chips.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price             object
price                 float64
bill                   object
dtype: object

In [26]:
chips["bill"]=chips["quantity"] * chips["price"]

In [30]:
chips.head()

,order_id,quantity,item_name,choice_description,item_price,price,bill
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98,33.96

In [29]:
chips.duplicated().sum() #df_name has any duplicate or not, is what we will find by this sum

59

In [32]:
df_name.drop_duplicates(subset=["col1","col2"])

NameError: name 'df_name' is not defined

In [2]:
#NaN is not a number, basically Null.
#find distinct city in this data
#find count of each cities, city, count(*)
#sort this data by state or time 
#find records count of each shape type
ufo.describe()

           City Colors Reported Shape Reported  State              Time
count     18215            2882          15597  18241             18241
unique     6475              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [8]:
#ufo.loc[(ufo["City"].str.lower()=="ithaca"), :]
ufo.loc[(ufo["City"].str.lower().str.contains("ithaca")) , :]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [9]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [12]:
ufo[ufo["City"]=="Ithaca"].head()

        City Colors Reported Shape Reported State              Time
0     Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
4068  Ithaca             NaN          CIGAR    NY    6/1/1979 19:00
5631  Ithaca             NaN          OTHER    MI    6/1/1987 17:00
6961  Ithaca             NaN          OTHER    NY    1/10/1993 0:30
7573  Ithaca       RED GREEN          LIGHT    NY  10/15/1994 18:00

In [14]:
ufo[ufo["City"] == "Ithaca"][["City","State"]]
#same thing can be done with loc in much more detailed way

         City State
0      Ithaca    NY
4068   Ithaca    NY
5631   Ithaca    MI
6961   Ithaca    NY
7573   Ithaca    NY
9088   Ithaca    NY
16537  Ithaca    MI
17049  Ithaca    NY

In [ ]:
#modify df so that some columns have null value in random fashion
#modify get_df function so that the user can pass a parameter which will be the percentage of null values and the dataframe will 
#have a few columns with that many NaN values

#can you create a dataframe manually using some functions and random values 
#include city and country as part of the dataframe being returned from get_df function
#for each recod city-county pair should be valid pair

#if salary is missing value in this manual dataframe, i.e NaN, how to fill NA. based on avg(sal) based on city and gender.
#if city is missing, find city of such avg salary guys and assign city in missing row from avg salary row